

int totalHammingDistance(int* nums, int numsSize)
{
    int ret_val             =   0       ;
    int bit1_nums           =   {0,}    ;
    int i                   =   0       ;
    int j                   =   0       ;
    int bit_arr[32]         =   {
        0x00000001,0x00000002,0x00000004,0x00000008,
        0x00000010,0x00000020,0x00000040,0x00000080,        
        0x00000100,0x00000200,0x00000400,0x00000800, 
        0x00001000,0x00002000,0x00004000,0x00008000, 
        0x00010000,0x00020000,0x00040000,0x00080000,
        0x00100000,0x00200000,0x00400000,0x00800000,        
        0x01000000,0x02000000,0x04000000,0x08000000, 
        0x10000000,0x20000000,0x40000000,0x80000000, 
    };
    
    
    for(i = 0; i < 32 ; i++)
    {
        bit1_nums  = 0;
        for(j=0;j<numsSize;j++)
        {
            if(bit_arr[i]&nums[j])
            {
               bit1_nums++; 
            }
        }
        ret_val += bit1_nums*(numsSize-bit1_nums);
    }
    return ret_val;
}

/*
执行结果：
通过
显示详情
执行用时 :112 ms, 在所有 C 提交中击败了6.90% 的用户
内存消耗 :7.8 MB, 在所有 C 提交中击败了100.00%的用户
*/

